## SQL 1

#### Installation requirements

You can either run `pip3 install pandas` on your ssh session or try doing the installation from the notebook.

In [ ]:
!pwd

In [ ]:
!ls

In [ ]:
!pip3 install pandas

In [ ]:
from sqlalchemy import create_engine, text
import pandas as pd

In [ ]:
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs639")
conn = engine.connect()

In [ ]:
list(conn.execute(text("show tables;")))

### Table creation

#### `Students` table
Let's create `Students` table with columns:
- `sid(int)` - primary key
- `name(text)` - required
- `gpa(float)`

In [ ]:
conn.execute(text("""
    create table Students (sid int, name text NOT NULL, gpa float, primary key(sid))
"""))

In [ ]:
list(conn.execute(text("show tables;")))

### Inserting data

Let's add a student: example: 101, "Alice", 3.2

In [ ]:
conn.execute(text("""
    INSERT INTO Students (sid, name, gpa) VALUES (101, "Alice", 3.2)
"""))

Add another student.

In [ ]:
conn.execute(text("""
    INSERT INTO Students (sid, name, gpa) VALUES (123, "Bob", 3.8)
"""))

### Projection aka `SELECT` clause in SQL

Retrieving all or specific columns from a table.

In [ ]:
pd.read_sql("SELECT * FROM Students", conn)

### Updating data

Let's change Alice's GPA to 3.7

In [ ]:
conn.execute(text("""
    UPDATE Students SET gpa = '3.7' WHERE sid = 101;
"""))

In [ ]:
pd.read_sql("SELECT * FROM Students", conn)

#### `Courses` table
Let's create accounts `Courses` with columns:
- `cid(int)` - primary key
- `cname(text)` - required
- `credits(int)` - required

In [ ]:
conn.execute(text("""
    create table Courses (cid int, cname text NOT NULL, credits int NOT NULL, primary key(cid))
"""))

In [ ]:
list(conn.execute(text("show tables;")))

### Table deletion

What if we wanted to delete a table?

In [ ]:
conn.execute(text("drop table Courses"))

Let's recreate `Courses` table. This time, let's make `cid` type `VARCHAR(255)` instead of int.

In [ ]:
conn.execute(text("""
    create table Courses (cid VARCHAR(255) PRIMARY KEY, cname text NOT NULL, credits int NOT NULL)
"""))

Let's insert the two courses from the slide example.

In [ ]:
conn.execute(text("""
    INSERT INTO Courses (cid, cname, credits) VALUES ("CS544", "Big Data", 3)
"""))
conn.execute(text("""
    INSERT INTO Courses (cid, cname, credits) VALUES ("CS639", "Data Management", 3)
"""))

#### `Enrolled` table

Let's create `Enrolled` table with columns:
- sid(int) - foreign key
- cid(VARCHAR (255)) - foreign key
- grade(text)

In [ ]:
conn.execute(text("""
    create table Enrolled (sid int, cid VARCHAR(255), grade text,
                           foreign key (sid) references Students(sid),
                           foreign key (cid) references Courses(cid))
"""))

In [ ]:
list(conn.execute(text("show tables;")))

Let's add the erollments from the slide example.

In [ ]:
conn.execute(text("""
    INSERT INTO Enrolled (sid, cid, grade) VALUES (123, "CS544", "A")
"""))

In [ ]:
conn.execute(text("""
    INSERT INTO Enrolled (sid, cid, grade) VALUES (101, "CS639", "A")
"""))

In [ ]:
pd.read_sql("SELECT * FROM Courses", conn)

What if we try to enroll a non-existing student?

In [ ]:
# doesn't work - no foreign key mapping
# conn.execute(text("""
#     INSERT INTO Enrolled (sid, cid, grade) VALUES (10, "No one", "Nothing")
# """))

Commit the transaction.

In [ ]:
conn.commit()

What if we try to delete Student with id 101 from Students table?

In [ ]:
# doesn't work - foreign key prevents this
# conn.execute(text("""
#     DELETE FROM Students WHERE sid = 101
# """))

### Load CSVs to MySQL Tables

### Spotify dataset: https://ms.sites.cs.wisc.edu/cs639/data/spotify.zip

In [ ]:
base_url = "https://ms.sites.cs.wisc.edu/cs639/data/"
df = pd.read_csv(base_url + "spotify.zip", compression="zip")
df.to_sql("songs", conn, index=False, if_exists="replace")

In [ ]:
pd.read_sql("SELECT * FROM songs", conn)